lelebrr/Willy_ESP32_S3/src/main.cpp
#include "core/led_control.h"
#include "core/main_menu.h"
#include <Arduino.h>
#include <globals.h>

#include "core/headless_mode.h"
#include "core/powerSave.h"
#include "core/serial_commands/cli.h"
#include "core/settings.h"
#include "core/utils.h"
#include "core/wifi/wifi_common.h"
#include "current_year.h"
#include "esp32-hal-psram.h"
#include "esp_task_wdt.h"
#include "esp_wifi.h"
#include "modules/rf/rf_utils.h"
#include "ui/cyber_menu.h"
#include <functional>
#include <string>
#include <vector>

#if !defined(LITE_VERSION) && !defined(DISABLE_INTERPRETER)
#include "modules/bjs_interpreter/interpreter.h"
#endif

bool tftInitialized = false;
volatile bool lvgl_rendering_active = false;
io_expander ioExpander;
WillyConfig willyConfig;
WillyConfigPins willyConfigPins;

SerialCli serialCli;
WillyUSBSerial usbSerial(&Serial);
SerialDevice *serialDevice = &usbSerial;

StartupApp startupApp;
String startupAppLuaScript = "";

MainMenu mainMenu;
SPIClass sdcardSPI;
#ifdef USE_HSPI_PORT
#ifndef VSPI
#define VSPI FSPI
#endif
SPIClass CC_NRF_SPI(VSPI);
#else
SPIClass CC_NRF_SPI(HSPI);
#endif

// Navigation Variables
volatile bool NextPress = false;
volatile bool PrevPress = false;
volatile bool UpPress = false;
volatile bool DownPress = false;
volatile bool SelPress = false;
volatile bool EscPress = false;
volatile bool AnyKeyPress = false;
volatile bool NextPagePress = false;
volatile bool PrevPagePress = false;
volatile bool LongPress = false;
volatile bool SerialCmdPress = false;
volatile int forceMenuOption = -1;
volatile uint8_t menuOptionType = 0;
String menuOptionLabel = "";
#ifdef HAS_ENCODER_LED
volatile int EncoderLedChange = 0;
#endif

TouchPoint touchPoint;

keyStroke KeyStroke;

SemaphoreHandle_t spiMutex = NULL;

TaskHandle_t xHandle;
void __attribute__((weak)) InputHandler() {
  // Read touch screen and update touchPoint
  updateTouchPoint();
}

void __attribute__((weak)) taskInputHandler(void *parameter) {
  Serial.println("[DBG] taskInputHandler started");
  while (true) {
    checkPowerSaveTime();

    // Input detection
    InputHandler();

    // Only process LVGL when explicitly enabled (splash or cyber menu)
    if (lvgl_rendering_active && lvgl_mutex &&
        xSemaphoreTake(lvgl_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
      lv_timer_handler();
      xSemaphoreGive(lvgl_mutex);
    }

    vTaskDelay(pdMS_TO_TICKS(15)); // Faster iteration (66Hz) for smooth touch
  }
}
// Public Globals Variables
unsigned long previousMillis = millis();
int prog_handler; // 0 - Flash, 1 - LittleFS, 3 - Download
String cachedPassword = "";
int8_t interpreter_state = -1;
bool sdcardMounted = false;
bool gpsConnected = false;

// wifi globals
// TODO put in a namespace
bool wifiConnected = false;
bool isWebUIActive = false;
String wifiIP;

bool BLEConnected = false;
bool returnToMenu;
String currentLoaderApp = "";
bool appRequiresClose = false;
bool isSleeping = false;
bool isScreenOff = false;
bool dimmer = false;
char timeStr[16];
time_t localTime;
struct tm *timeInfo;
#if defined(HAS_RTC)
#if defined(HAS_RTC_PCF85063A)
pcf85063_RTC _rtc;
#else
cplus_RTC _rtc;
#endif
RTC_TimeTypeDef _time;
RTC_DateTypeDef _date;
bool clock_set = true;
#else
ESP32Time rtc;
bool clock_set = false;
#endif

std::vector<Option> options;
// Protected global variables
#if defined(HAS_SCREEN)
tft_logger tft = tft_logger(); // Invoke custom library
tft_sprite sprite = tft_sprite(&tft);
tft_sprite draw = tft_sprite(&tft);
volatile int tftWidth = TFT_HEIGHT;
volatile int tftHeight = TFT_WIDTH;
#else
tft_logger tft;
SerialDisplayClass &sprite = tft;
SerialDisplayClass &draw = tft;
volatile int tftWidth = VECTOR_DISPLAY_DEFAULT_HEIGHT;
volatile int tftHeight = VECTOR_DISPLAY_DEFAULT_WIDTH;
#endif

#include "ui/willy_splash.h" // Splash screen Willy
#include "willy_logger.h"    // Sistema de logging centralizado
#include <Wire.h>

/*********************************************************************
 **  Function: begin_storage
 **  Config LittleFS and SD storage
 *********************************************************************/
void begin_storage() {
  if (!LittleFS.begin(true)) {
    LittleFS.format(), LittleFS.begin();
  }
  // SD card disabled during boot — SD shares TFT SPI bus and
  // failed mount attempts corrupt SPI state, breaking touch.
  // SD will be mounted on-demand when user accesses SD features.
  bool checkFS = false;
  Serial.println("[SD] SD card skipped at boot (shares SPI with touch)");
  willyConfig.fromFile(checkFS);
  willyConfigPins.fromFile(checkFS);
}

/*********************************************************************
 **  Function: _setup_gpio()
 **  Now handled in board-specific interface.cpp to avoid conflicts.
 *********************************************************************/
void __attribute__((weak)) _setup_gpio() {
  // Default empty implementation
}

/*********************************************************************
 **  Function: _post_setup_gpio()
 **  Post IO setup (like display backlight, and custom IO expanders logic)
 *********************************************************************/
void _post_setup_gpio() {
  // Turn on backlight if configured
#ifdef TFT_BL
  if (TFT_BL >= 0) {
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);
  }
#endif
}

/*********************************************************************
 **  Function: setup_gpio
 **  Setup GPIO pins
 *********************************************************************/
void setup_gpio() {

  // init setup from /ports/*/interface.h
  _setup_gpio();

  // Smoochiee v2 uses a AW9325 tro control GPS, MIC, Vibro and CC1101 RX/TX
  // powerlines
  ioExpander.init(IO_EXPANDER_ADDRESS, &Wire);

#if TFT_MOSI > 0
  if (willyConfigPins.CC1101_bus.mosi == (gpio_num_t)TFT_MOSI)
    initCC1101once(&tft.getSPIinstance()); // (T_EMBED), CORE2 and others
  else
#endif
      if (willyConfigPins.CC1101_bus.mosi == willyConfigPins.SDCARD_bus.mosi)
    initCC1101once(
        &sdcardSPI); // (ARDUINO_M5STACK_CARDPUTER) and (ESP32S3DEVKITC1) and
                     // devices that share CC1101 pin with only SDCard
  else
    initCC1101once(NULL);
  // (ARDUINO_M5STICK_C_PLUS) || (ARDUINO_M5STICK_C_PLUS2) and others that
  // doesn´t share SPI with other devices (need to change it when Willy board
  // comes to shore)
}

/*********************************************************************
 **  Function: begin_tft
 **  Config tft display hardware only (no touch calibration here).
 **  Touch calibration is done in setup_touch() AFTER begin_storage().
 *********************************************************************/
void begin_tft() {
  Serial.println("[BOOT] Iniciando tft.init()...");

  tft.init();
  tft.setRotation(1); // Rotation 1 = landscape (320x240)
  tft.invertDisplay(
      false); // ILI9341: set to false for normal colors (true inverts all)
  tft.fillScreen(TFT_BLACK);

  Serial.printf("[DISPLAY] TFT resolution after rotation: %dx%d\n", tft.width(),
                tft.height());

  tftWidth = tft.width();
  tftHeight = tft.height();

  tftInitialized = true;
  Serial.printf("[DISPLAY] TFT initialized! tftWidth=%d, tftHeight=%d\n",
                tftWidth, tftHeight);
}

/*********************************************************************
 **  Function: setup_touch
 **  Load or run touch calibration. Must be called AFTER begin_storage()
 **  so LittleFS is already mounted.
 *********************************************************************/
void setup_touch() {
#ifdef HAS_TOUCH
  uint16_t calData[5];
  bool needsCalibration = false;

  // Add a small delay to let the SPI bus settle after initializations
  delay(100);

  // Check if calibration file exists (LittleFS already mounted by
  // begin_storage)
  if (!LittleFS.exists("/touch_cal.dat")) {
    needsCalibration = true;
    Serial.println("[TOUCH] No calibration file found in LittleFS.");
  }

#ifdef JOY_BTN_PIN
  // Hold joystick button during boot to force recalibration
  pinMode(JOY_BTN_PIN, INPUT_PULLUP);
  delay(100);
  int btnVal = digitalRead(JOY_BTN_PIN);
  Serial.printf(
      "[TOUCH] Checking JOY_BTN_PIN (%d): %s\n", JOY_BTN_PIN,
      (btnVal == LOW ? "LOW (Pressed/Force Cal)" : "HIGH (Not Pressed)"));
  if (btnVal == LOW) {
    needsCalibration = true;
    Serial.println("[TOUCH] Joystick button HELD - deleting old data and "
                   "forcing recalibration.");
    LittleFS.remove("/touch_cal.dat");
  }
#endif

