lelebrr/Willy_ESP32_S3/src/main.cpp
  if (needsCalibration) {
    Serial.println("[TOUCH] Starting CALIBRATION - touch the crosshairs!");
    tft.fillScreen(TFT_BLACK);

    // Attempt calibration but define a timeout or fallback if possible
    // (TFT_eSPI's calibrateTouch is blocking, but we can verify results after)
    Serial.println("[TOUCH] Calling tft.calibrateTouch()...");
    // Use 5 points for better accuracy (default is 25, but 5 is minimum)
    tft.calibrateTouch(calData, TFT_RED, TFT_BLACK, 5);
    Serial.printf("[TOUCH] Calibration finished. Result: %d,%d,%d,%d,%d\n",
                  calData[0], calData[1], calData[2], calData[3], calData[4]);

    // Basic sanity check on calData: if all are 0 or 65535, it failed
    if (calData[0] == 0 || calData[0] == 0xFFFF || calData[0] == calData[1]) {
      Serial.println(
          "[TOUCH] Calibration FAILED (invalid data). Using defaults.");
      calData[0] = 280;
      calData[1] = 3555;
      calData[2] = 298;
      calData[3] = 3505;
      calData[4] = 7;
    } else {
      // Save to LittleFS (now guaranteed to be mounted)
      File f = LittleFS.open("/touch_cal.dat", "w");
      if (f) {
        f.write((uint8_t *)calData, 10);
        f.close();
        Serial.println("[TOUCH] Calibration SAVED to /touch_cal.dat");
      } else {
        Serial.println("[TOUCH] WARNING: Could not save calibration!");
      }
    }
    tft.fillScreen(TFT_BLACK);
  } else {
    // Load existing calibration
    File f = LittleFS.open("/touch_cal.dat", "r");
    if (f) {
      f.read((uint8_t *)calData, 10);
      f.close();
      Serial.println("[TOUCH] Calibration loaded from /touch_cal.dat");
    } else {
      // Fallback defaults for rotation=1 (landscape)
      calData[0] = 280;
      calData[1] = 3555;
      calData[2] = 298;
      calData[3] = 3505;
      calData[4] = 7;
      Serial.println("[TOUCH] Using hardcoded default calibration");
    }
  }

  tft.setTouch(calData);
  Serial.printf("[TOUCH] CalData applied: %d,%d,%d,%d,%d\n", calData[0],
                calData[1], calData[2], calData[3], calData[4]);
#endif
}

/*********************************************************************
 **  Function: boot_screen
 **  Draw boot screen
 *********************************************************************/
void boot_screen() {
  Serial.println("[BOOT] Inside boot_screen()...");
  tft.setTextColor(willyConfig.priColor, willyConfig.bgColor);
  tft.setTextSize(FM);
  tft.drawPixel(0, 0, willyConfig.bgColor);
  Serial.println("[BOOT] Drawing 'Willy' string...");
  tft.drawCentreString("Willy", tftWidth / 2, 10, 1);
  tft.setTextSize(FP);
  Serial.println("[BOOT] Drawing version string...");
  tft.drawCentreString(WILLY_VERSION, tftWidth / 2, 25, 1);
  tft.setTextSize(FM);
  Serial.println("[BOOT] Drawing 'WILLY FIRMWARE' string...");
  tft.drawCentreString("WILLY FIRMWARE", tftWidth / 2, tftHeight + 2,
                       1); // will draw outside the screen on non touch devices
  Serial.println("[BOOT] Finished boot_screen().");
}

/*********************************************************************
 **  Function: boot_screen_anim
 **  Draw boot screen
 *********************************************************************/
void boot_screen_anim() {
  boot_screen();
  int i = millis();
  // checks for boot.jpg in SD and LittleFS for customization
  int boot_img = 0;
  bool drawn = false;
  if (sdcardMounted) {
    Serial.println("[BOOT] Checking SD for /boot.jpg...");
    if (SD.exists("/boot.jpg"))
      boot_img = 1;
    else {
      Serial.println("[BOOT] Checking SD for /boot.gif...");
      if (SD.exists("/boot.gif"))
        boot_img = 3;
    }
  }
  if (boot_img == 0) {
    Serial.println("[BOOT] Checking LittleFS for /boot.jpg...");
    if (LittleFS.exists("/boot.jpg"))
      boot_img = 2;
    else {
      Serial.println("[BOOT] Checking LittleFS for /boot.gif...");
      if (LittleFS.exists("/boot.gif"))
        boot_img = 4;
    }
  }
  tft.drawPixel(0, 0,
                0); // Forces back communication with TFT, to avoid ghosting
  // Start image loop
  while (millis() < (unsigned long)(i + 7000)) { // boot image lasts for 5 secs
    if ((millis() - i > 2000) && !drawn) {
      tft.fillRect(0, 45, tftWidth, tftHeight - 45, willyConfig.bgColor);
      if (boot_img > 0 && !drawn) {
        tft.fillScreen(willyConfig.bgColor);
        if (boot_img == 5) {
          drawImg(*willyConfig.themeFS(),
                  willyConfig.getThemeItemImg(willyConfig.theme.paths.boot_img),
                  0, 0, true, 3600);
          Serial.println("Image from SD theme");
        } else if (boot_img == 1) {
          drawImg(SD, "/boot.jpg", 0, 0, true);
          Serial.println("Image from SD");
        } else if (boot_img == 2) {
          drawImg(LittleFS, "/boot.jpg", 0, 0, true);
          Serial.println("Image from LittleFS");
        } else if (boot_img == 3) {
          drawImg(SD, "/boot.gif", 0, 0, true, 3600);
          Serial.println("Image from SD");
        } else if (boot_img == 4) {
          drawImg(LittleFS, "/boot.gif", 0, 0, true, 3600);
          Serial.println("Image from LittleFS");
        }
        tft.drawPixel(
            0, 0, 0); // Forces back communication with TFT, to avoid ghosting
      }
      drawn = true;
    }
#if !defined(LITE_VERSION)
    if (!boot_img && (millis() - i > 2200) && (millis() - i) < 2700)
      tft.drawRect(2 * tftWidth / 3, tftHeight / 2, 2, 2, willyConfig.priColor);
    if (!boot_img && (millis() - i > 2700) && (millis() - i) < 2900)
      tft.fillRect(0, 45, tftWidth, tftHeight - 45, willyConfig.bgColor);
    if (!boot_img && (millis() - i > 2900) && (millis() - i) < 3400)
      tft.drawXBitmap(2 * tftWidth / 3 - 30, 5 + tftHeight / 2,
                      willy_small_bits, willy_small_width, willy_small_height,
                      willyConfig.bgColor, willyConfig.priColor);
    if (!boot_img && (millis() - i > 3400) && (millis() - i) < 3600)
      tft.fillScreen(willyConfig.bgColor);
    if (!boot_img && (millis() - i > 3600))
      tft.drawXBitmap((tftWidth - 238) / 2, (tftHeight - 133) / 2, bits,
                      bits_width, bits_height, willyConfig.bgColor,
                      willyConfig.priColor);
#endif
    if (check(AnyKeyPress)) // If any key or M5 key is pressed, it'll jump the
                            // boot screen
    {
      tft.fillScreen(willyConfig.bgColor);
      delay(10);
      return;
    }
  }

  // Clear splashscreen
  tft.fillScreen(willyConfig.bgColor);
}

/*********************************************************************
 **  Function: init_clock
 **  Clock initialisation for propper display in menu
 *********************************************************************/
void init_clock() {
#if defined(HAS_RTC)
  _rtc.begin();
#if defined(HAS_RTC_BM8563)
  _rtc.GetBm8563Time();
#endif
#if defined(HAS_RTC_PCF85063A)
  _rtc.GetPcf85063Time();
#endif
  _rtc.GetTime(&_time);
  _rtc.GetDate(&_date);

  struct tm timeinfo = {};
  timeinfo.tm_sec = _time.Seconds;
  timeinfo.tm_min = _time.Minutes;
  timeinfo.tm_hour = _time.Hours;
  timeinfo.tm_mday = _date.Date;
  timeinfo.tm_mon = _date.Month > 0 ? _date.Month - 1 : 0;
  timeinfo.tm_year = _date.Year >= 1900 ? _date.Year - 1900 : 0;
  time_t epoch = mktime(&timeinfo);
  struct timeval tv = {.tv_sec = epoch};
  settimeofday(&tv, nullptr);
#else
  struct tm timeinfo = {};
  timeinfo.tm_year = CURRENT_YEAR - 1900;
  timeinfo.tm_mon = 0x05;
  timeinfo.tm_mday = 0x14;
  time_t epoch = mktime(&timeinfo);
  rtc.setTime(epoch);
  clock_set = true;
  struct timeval tv = {.tv_sec = epoch};
  settimeofday(&tv, nullptr);
#endif
}

/*********************************************************************
 **  Function: init_led
 **  Led initialisation
 *********************************************************************/
void init_led() {
#ifdef HAS_RGB_LED
  beginLed();
#endif
}

/*********************************************************************
 **  Function: startup_sound
 **  Play sound or tone depending on device hardware
 *********************************************************************/
void startup_sound() {
  if (willyConfig.soundEnabled == 0)
    return; // if sound is disabled, do not play sound
#if !defined(LITE_VERSION)
#if defined(BUZZ_PIN)
  // Bip M5 just because it can. Does not bip if splashscreen is bypassed
  _tone(5000, 50);
  delay(200);
  _tone(5000, 50);
  /*  2fix: menu infinite loop */
#elif defined(HAS_NS4168_SPKR)
  // play a boot sound
  if (willyConfig.theme.boot_sound) {
    playAudioFile(
        willyConfig.themeFS(),
        willyConfig.getThemeItemImg(willyConfig.theme.paths.boot_sound));
  } else if (SD.exists("/boot.wav")) {
    playAudioFile(&SD, "/boot.wav");
  } else if (LittleFS.exists("/boot.wav")) {
    playAudioFile(&LittleFS, "/boot.wav");
  }
#endif
#endif
}

/*********************************************************************
 **  Function: setup
 **  Where the devices are started and variables set
 *********************************************************************/
void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println("\n=== WILLY ESP S3 - BOOT CORRIGIDO ===");
  spiMutex = xSemaphoreCreateMutex();

  Serial.println("[BOOT] Initializing system...");

