lelebrr/Willy_ESP32_S3/src/main.cpp
  // NENHUM tft.init() aqui (deixa para begin_tft())
  // NENHUM hack de backlight GPIO 21/3

  log_d("Total heap: %d", ESP.getHeapSize());
  log_d("Free heap: %d", ESP.getFreeHeap());
  if (psramInit())
    log_d("PSRAM Started");
  if (psramFound())
    log_d("PSRAM Found");
  else
    log_d("PSRAM Not Found");
  log_d("Total PSRAM: %d", ESP.getPsramSize());
  log_d("Free PSRAM: %d", ESP.getFreePsram());

  // declare variables
  prog_handler = 0;
  sdcardMounted = false;
  wifiConnected = false;
  BLEConnected = false;
  willyConfig.bright = 100; // theres is no value yet
  willyConfigPins.rotation = ROTATION;

  Serial.println("[BOOT] Initializing GPIOs...");
  setup_gpio();

#if defined(HAS_SCREEN)
  begin_tft();
#else
  tft.begin();
  tftInitialized =
      true; // For devices without HAS_SCREEN explicitly but using tft
#endif

  Serial.println("Starting begin_storage()...");
  begin_storage();

#if defined(HAS_SCREEN) && defined(HAS_TOUCH)
  // Touch calibration MUST happen after begin_storage() so LittleFS is mounted
  setup_touch();
#endif

  if (tftInitialized) {
    Serial.println("[BOOT] Iniciando LVGL + Cyber Menu...");
    initLVGL();

    // Show LVGL splash screen (orca animation)
    Serial.println("[BOOT] Showing splash screen...");
    lvgl_rendering_active = true;
    lv_obj_t *splash_scr = lv_scr_act();
    show_willy_splash(splash_scr);
    // Drive LVGL rendering for splash duration (~5s)
    unsigned long splashStart = millis();
    while (millis() - splashStart < 5000) {
      if (lvgl_mutex &&
          xSemaphoreTake(lvgl_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        lv_timer_handler();
        xSemaphoreGive(lvgl_mutex);
      }
      vTaskDelay(pdMS_TO_TICKS(15));
      // Allow skipping splash with any key
      if (AnyKeyPress) {
        AnyKeyPress = false;
        Serial.println("[BOOT] Splash skipped by user.");
        break;
      }
    }
    // Clean up splash and disable LVGL rendering for TFT direct menu
    lv_obj_clean(splash_scr);
    if (lvgl_mutex &&
        xSemaphoreTake(lvgl_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
      lv_timer_handler();
      xSemaphoreGive(lvgl_mutex);
    }
    tft.fillScreen(TFT_BLACK);
    delay(200);
    lvgl_rendering_active = false;
    Serial.println("[BOOT] Splash complete. LVGL paused for TFT menu.");

  } else {
    Serial.println("[WARNING] MODO HEADLESS ATIVADO - Tela não encontrada");
    Serial.println("[INFO] Serial + Web Dashboard ainda funcionam normalmente");
  }

  init_clock();
  init_led();

  options.reserve(20); // preallocate some options space to avoid fragmentation

  // Set WiFi country to avoid warnings and ensure max power
  const wifi_country_t country = {.cc = "US",
                                  .schan = 1,
                                  .nchan = 14,
#ifdef CONFIG_ESP_PHY_MAX_TX_POWER
                                  .max_tx_power =
                                      CONFIG_ESP_PHY_MAX_TX_POWER, // 20
#endif
                                  .policy = WIFI_COUNTRY_POLICY_MANUAL};

  esp_wifi_set_max_tx_power(80); // 80 translates to 20dBm
  esp_wifi_set_country(&country);

  // Some GPIO Settings (such as CYD's brightness control must be set after tft
  // and sdcard)
  _post_setup_gpio();
  // end of post gpio begin

  // #ifndef USE_TFT_eSPI_TOUCH
  // This task keeps running all the time, will never stop
  xTaskCreate(taskInputHandler,              // Task function
              "InputHandler",                // Task Name
              INPUT_HANDLER_TASK_STACK_SIZE, // Stack size
              NULL,                          // Task parameters
              2,       // Task priority (0 to 3), loopTask has priority 2.
              &xHandle // Task handle (not used)
  );
  // #endif
#if defined(HAS_SCREEN)
  willyConfig.openThemeFile(willyConfig.themeFS(), willyConfig.themePath,
                            false);
  if (!willyConfig.instantBoot) {
    // boot_screen_anim() removed — replaced by LVGL splash in setup()
    startup_sound();
  }
  if (willyConfig.wifiAtStartup) {
    log_i("Loading Wifi at Startup");
    xTaskCreate(wifiConnectTask,   // Task function
                "wifiConnectTask", // Task Name
                4096,              // Stack size
                NULL,              // Task parameters
                2,   // Task priority (0 to 3), loopTask has priority 2.
                NULL // Task handle (not used)
    );
  }
#endif
  //  start a task to handle serial commands while the webui is running
  startSerialCommandsHandlerTask(true);

  wakeUpScreen();
  if (willyConfig.startupApp != "" &&
      !startupApp.startApp(willyConfig.startupApp)) {
    willyConfig.setStartupApp("");
  }
}

/**********************************************************************
 **  Function: loop
 **  Main loop
 **********************************************************************/
#if defined(HAS_SCREEN)
void loop() {
#if !defined(LITE_VERSION) && !defined(DISABLE_INTERPRETER)
  if (interpreter_state > 0) {
    vTaskDelete(
        serialcmdsTaskHandle); // stop serial commands while in interpreter
    vTaskDelay(pdMS_TO_TICKS(10));
    interpreter_state = 2;
    Serial.println("Entering interpreter...");
    while (interpreter_state > 0) {
      vTaskDelay(pdMS_TO_TICKS(500));
    }
    Serial.println("Exiting interpreter...");
    if (interpreter_state == -1) {
      interpreterTaskHandler = NULL;
    }
    startSerialCommandsHandlerTask();
    previousMillis =
        millis(); // ensure that will not dim screen when get back to menu
  }
#endif
  tft.fillScreen(willyConfig.bgColor);

  mainMenu.begin();
  delay(1);
}
#else

void loop() {
  tft.setLogging();
  Serial.println("\n"
                 "██      ██ ██ ██      ██      ██    ██ \n"
                 "██      ██ ██ ██      ██       ██  ██  \n"
                 "██  ██  ██ ██ ██      ██        ████   \n"
                 "██ ████ ██ ██ ██      ██         ██    \n"
                 " ███  ███  ██ ███████ ███████    ██    \n"
                 "                                       \n"
                 "         PREDATORY FIRMWARE\n\n"
                 "Tips: Connect to the WebUI for better experience\n"
                 "      Add your network by sending: wifi add ssid password\n\n"
                 "At your command:");

  // Enable navigation through webUI
  tft.fillScreen(willyConfig.bgColor);
  mainMenu.begin();
  vTaskDelay(10 / portTICK_PERIOD_MS);
}
#endif
